import { FiShoppingBag } from "react-icons/fi";
import { GiCardboardBoxClosed, GiCardboardBox, GiPapers } from "react-icons/gi";
import { LuBox } from "react-icons/lu";
import { LiaTapeSolid } from "react-icons/lia";
import { TbCards } from "react-icons/tb";
import { SlEnvolopeLetter } from "react-icons/sl";
import { PiStickerDuotone } from "react-icons/pi";
import { PiBuildingOffice } from "react-icons/pi";

import shoppingBag from "../../public/ProductsMockup/shoppingBag.jpg";
import hardBox from "../../public/ProductsMockup/hardBox.jpg";
import cardboardBox from "../../public/ProductsMockup/cardboardBox.jpg";
import keyboardBox from "../../public/ProductsMockup/keyboardBox.jpg";
import parchmentPaper from "../../public/ProductsMockup/parchmentPaper.jpg";
import customerCard from "../../public/ProductsMockup/customerCard.jpg";
import label from "../../public/ProductsMockup/label.jpg";
import clothTag from "../../public/ProductsMockup/clothTag.jpg";
import ribbon from "../../public/ProductsMockup/ribbon.jpg";
import officeSet from "../../public/ProductsMockup/officeSet.jpg";

export const ServiceData = [
  {
    id: "shoppingBag",
    icon: FiShoppingBag,
    title: "شاپینگ بگ",
    content:
      "جهت اطلاعات بیشتر راجع به جنس بگ، نوع بند، خدمات کوب و نوع تکسکچر کلیک کنید",
    backgroundImage: shoppingBag,
    services: [
      "نوع جنس: پارچه ای، داس بگ، ایندربورد، تحریر، کرافت",
      "بند: ربانی، پیچی، ربانی پیچی",
      "خدمات کوب: برجسته، فرورفته، انواع رنگ کوب",
      "تکستچر: فابیانو، چرمی، کتان، چکشی",
    ],
    description: {
      title: "شاپینگ بگ؛انتخابی شیک و کاربردی برای بسته‌بندی",
      firstParagraph:
        "شاپینگ بگ یکی از بهترین انتخاب‌ها برای بسته‌بندی محصولات و هدایای تبلیغاتی است. ما در وی پکیجینگ مجموعه‌ای متنوع از شاپینگ بگ‌ها را در جنس‌های مختلف از جمله پارچه‌ای، داس‌بگ، ایندربورد، تحریر و کرافت ارائه می‌دهیم که هر کدام متناسب با نیازهای مختلف طراحی شده‌اند",
      secondParagraph:
        "این شاپینگ بگ‌ها با بندهای ربانی، پیچی و ربانی پیچی عرضه می‌شوند که علاوه بر زیبایی، دوام بالایی دارند. همچنین، می‌توانید با استفاده از خدمات کوب برجسته، فرورفته و انواع رنگ کوب طراحی منحصربه‌فردی داشته باشید. تکستچرهای متنوع مانند فابیان، چرمی، کتان و چکشی نیز امکان انتخاب بهترین گزینه را متناسب با سلیقه و نیاز شما فراهم می‌کنند",
    },
  },
  {
    id: "hardBox",
    icon: GiCardboardBoxClosed,
    title: "هاردباکس",
    content:
      "جهت اطلاعات بیشتر راجع به جنس باکس، خدمات کوب و نوع تکسکچر کلیک کنید",

    backgroundImage: hardBox,
    services: [
      "دو تکه: مگنتی، کشویی، درب و زیره",
      "سه تکه: مگنتی، کشویی، درب و زیره و داخل",
      "نوع جنس: فابریک، گلاسه، سلفون",
      "خدمات کوب: برجسته، فرورفته، انواع رنگ کوب",
      "تکستچر: فابیانو، چرمی، کتان، چکشی، چوبی",
    ],
    description: {
      title: "هاردباکس؛ ترکیب استحکام، زیبایی و لوکس بودن در بسته‌بندی",
      firstParagraph:
        "هاردباکس یکی از محبوب‌ترین و حرفه‌ای‌ترین انواع بسته‌بندی است که در صنایع مختلف مانند هدایا، محصولات لوکس، لوازم آرایشی، طلا و جواهر و کالاهای دیجیتال کاربرد فراوانی دارد. این نوع جعبه به دلیل استحکام بالا، ظاهر شکیل و قابلیت شخصی‌سازی بالا، به انتخاب اول بسیاری از برندهای معتبر تبدیل شده است. طراحی‌های دو تکه مانند مگنتی، کشویی و درب و زیره، یا سه تکه با جزئیات بیشتر، زیبایی و کارایی را در کنار هم ارائه می‌دهد",
      secondParagraph:
        "ما در مجموعه‌ی خود خدمات متنوعی برای تولید هاردباکس ارائه می‌دهیم؛ از انتخاب نوع جنس مانند فابریک، گلاسه یا سلفون گرفته تا تنوع در تکستچرهای خاص مانند فابیان، چرمی، کتان، چکشی و چوبی. همچنین خدمات کوب از جمله برجسته، فرورفته و انواع رنگ‌کوب، به شما این امکان را می‌دهد که بسته‌بندی خود را منحصربه‌فرد و مطابق با هویت برندتان طراحی کنید. اگر به دنبال بسته‌بندی حرفه‌ای هستید که هم ماندگار باشد و هم تاثیرگذار، هاردباکس بهترین گزینه است",
    },
  },
  {
    id: "cardboardBox",
    icon: GiCardboardBox,
    title: "باکس مقوایی",
    content:
      "جهت اطلاعات بیشتر راجع به نوع باکس ،جنس  خدمات کوب و نوع تکسکچر کلیک کنید",

    backgroundImage: cardboardBox,
    services: [
      "انواع باکس: جعبه دارویی، دو تکه (درب و زیره)، کشویی، مثلثی، بگ باکس",
      "نوع جنس: فابریک، ایندربورد",
      "خدمات کوب: برجسته، فرورفته، انواع رنگ کوب",
      "تکستچر: فابیانو، چرمی، کتان، چکشی",
    ],
    description: {
      title:
        "باکس مقوایی؛ انتخابی مقرون‌به‌صرفه و حرفه‌ای برای بسته‌بندی متنوع",
      firstParagraph:
        "باکس مقوایی یکی از پرکاربردترین و اقتصادی‌ترین انتخاب‌ها در حوزه بسته‌بندی به شمار می‌رود. این نوع جعبه به دلیل انعطاف بالا در طراحی، تنوع در ساختار و قابلیت چاپ و کوب، در صنایع مختلف از جمله دارویی، آرایشی، لوازم التحریر، پوشاک و حتی محصولات لوکس، کاربرد دارد. طراحی‌هایی مثل جعبه دارویی، ۲ تکه درب و زیره، کشویی، مدل‌های خاص مثلثی و حتی بگ‌باکس، باعث شده تا باکس مقوایی هم از نظر عملکرد و هم از نظر زیبایی، پاسخگوی نیاز برندها باشد",
      secondParagraph:
        "در فرآیند تولید این باکس‌ها، امکان انتخاب متریال‌هایی مثل مقوای فابریک و ایندربورد وجود دارد که کیفیت چاپ بالا و دوام مناسبی را تضمین می‌کنند. همچنین بافت‌های جذابی مانند فابیانو، چرمی، کتان و چکشی و خدمات کوب متنوع مثل برجسته، فرورفته و رنگ‌کوب‌های خاص، امکان شخصی‌سازی و خلق یک تجربه بصری خاص برای مشتریان شما را فراهم می‌کند. اگر به دنبال بسته‌بندی متنوع، باکیفیت و مقرون‌به‌صرفه هستید، باکس مقوایی بهترین گزینه برای شماست",
    },
  },
  {
    id: "keyboardBox",
    icon: LuBox,
    title: "باکس کیبوردی",
    content:
      "جهت اطلاعات بیشتر راجع به جنس باکس ،خدمات کوب و نوع تکسکچر کلیک کنید",

    backgroundImage: keyboardBox,
    services: [
      "نوع جنس: ایفولوت، ایندربورد",
      "خدمات کوب: برجسته، فرورفته، انواع رنگ کوب",
      "تکستچر: فابیانو، چرمی، کتان، چکشی",
    ],
    description: {
      title: "باکس کیبوردی؛ ترکیبی از کاربرد، استحکام و زیبایی در بسته‌بندی",
      firstParagraph:
        "باکس کیبوردی یکی از محبوب‌ترین انتخاب‌ها برای بسته‌بندی‌های خاص و کاربردی است. طراحی درب‌دار و تاشوی این باکس باعث می‌شود که باز و بسته کردن آن بسیار راحت بوده و در عین حال ظاهر کلاسیک و شیکی داشته باشد. این نوع جعبه معمولاً در صنایع لوکس، الکترونیکی، پوشاک، تبلیغاتی و حتی اقلام خاص استفاده می‌شود و به دلیل ساختار محکم و طراحی جذاب، حس حرفه‌ای بودن برند را به مشتری منتقل می‌کند",
      secondParagraph:
        "در تولید باکس کیبوردی از متریال‌هایی مانند مقوای ایفولوت و ایندربورد استفاده می‌شود که علاوه بر دوام بالا، سطح مناسبی برای چاپ و خدمات تکمیلی ارائه می‌دهند. همچنین بافت‌هایی نظیر فابیانو، چرمی، کتان و چکشی همراه با خدمات کوب متنوع از جمله برجسته، فرورفته و انواع رنگ‌کوب، امکان خلق یک بسته‌بندی خاص، زیبا و منحصر به‌فرد را فراهم می‌کنند که در نگاه اول تأثیرگذار خواهد بود",
    },
  },
  {
    id: "parchmentPaper",
    icon: GiPapers,
    title: "کاغذ پوستی",
    content: "جهت اطلاعات بیشتر راجع به جنس کاغذ و خدمات چاپ کلیک کنید",
    backgroundImage: parchmentPaper,
    services: [
      "نوع جنس: گرماژ مختلف (نازک تا ضخیم)، شفاف یا نیمه‌شفاف، رنگی یا سفید",
      "خدمات کوب: برجسته، فرورفته، انواع رنگ کوب",
    ],
    description: {
      title: "کاغذ پوستی؛ انتخابی سبک، ظریف و شیک برای بسته‌بندی‌های خاص",
      firstParagraph:
        "کاغذ پوستی یکی از رایج‌ترین و در عین حال جذاب‌ترین متریال‌ها در صنعت بسته‌بندی است که به دلیل ظاهر نیمه‌شفاف، لطافت خاص و حس مینیمال آن، توجه بسیاری از برندها را جلب کرده است. این کاغذ معمولاً برای بسته‌بندی لباس، لوازم آرایشی، اکسسوری و محصولات لوکس استفاده می‌شود و تجربه‌ای متفاوت و حرفه‌ای از باز کردن محصول را برای مشتری رقم می‌زند",
      secondParagraph:
        "ما در مجموعه‌مان امکان چاپ اختصاصی روی کاغذ پوستی را فراهم کرده‌ایم؛ از جمله چاپ لوگو با رنگ‌های اختصاصی، خدمات کوب (مانند برجسته و فرورفته)، طلاکوب، نقره‌کوب و انواع رنگ‌کوب. همچنین می‌توانیم سایز و برش کاغذ پوستی را کاملاً مطابق با نیاز محصول شما انجام دهیم. این خدمات باعث می‌شوند بسته‌بندی شما نه تنها زیبا، بلکه به ابزاری مؤثر برای برندینگ تبدیل شود",
    },
  },
  {
    id: "label",
    icon: PiStickerDuotone,
    title: "لیبل",
    content: "جهت اطلاعات بیشتر راجع به خدمات مربوط به چاپ لیبل کلیک کنید",
    backgroundImage: label,
    services: [
      `نوع جنس: کاغذی (تحریر، گلاسه، نیمه‌گلاسه)‌،
       ضدآب و مقاوم، متالایز (طلایی، نقره‌ای، آینه‌ای)‌، ترنسپرنت (شفاف)‌، کرافت (ظاهر طبیعی و کلاسیک)‌`,
      `خدمات کوب: برجسته، فرورفته، انواع رنگ کوب`,
      "تکستچر و سایر خدمات ویژه: برش در شکل‌های خاص (دایره‌ای، بیضی، لوگویی)، لمینت یا روکش یووی، چسبندگی معمولی، قوی، یا قابل جدا شدن، طراحی سفارشی متناسب با برند",
    ],
    description: {
      title: "لیبل؛ ترکیبی از هویت برند، اطلاعات محصول و جذابیت در بسته‌بندی",
      firstParagraph:
        "لیبل‌ها یکی از اجزای ضروری در صنعت بسته‌بندی و معرفی محصولات به شمار می‌روند. این محصولات چاپی که بر روی بسته‌بندی قرار می‌گیرند، نقش مهمی در شناسایی و نمایش اطلاعات محصول دارند. لیبل‌ها به برندها این امکان را می‌دهند تا با استفاده از طراحی‌های منحصر به فرد و اطلاعات دقیق، محصول خود را به طور مؤثر معرفی کنند و در عین حال به حفظ کیفیت بسته‌بندی کمک کنند",
      secondParagraph:
        "لیبل‌ها می‌توانند از مواد مختلفی ساخته شوند تا مطابق با نیازهای خاص محصول و مصرف‌کننده طراحی شوند. برای مثال، لیبل‌های کاغذی برای محصولات عمومی و لیبل‌های ضدآب برای محصولات مقاوم در برابر آب و رطوبت مناسب هستند. همچنین، با استفاده از خدمات ویژه‌ای مانند برجسته‌سازی، فرورفتگی و رنگ کوب، می‌توان ظاهری جذاب و متمایز به لیبل‌ها بخشید و تجربه‌ای منحصربه‌فرد برای مشتریان ایجاد کرد",
    },
  },
  {
    id: "customerCard",
    icon: SlEnvolopeLetter,
    title: "کارت و پاکت کاستومر",
    content: "جهت اطلاعات بیشتر راجع به خدمات کلیک کنید",
    backgroundImage: customerCard,
    services: [
      "نوع جنس: کاغذی (تحریر، گلاسه، نیمه‌گلاسه)، سلفون، کرافت، متالایز",
      "خدمات کوب: برجسته، فرورفته، انواع رنگ کوب",
      "تکستچر: فابیانو، چرمی، کتان، چکشی",
    ],
    description: {
      title: "کارت و پاکت کاستومر؛ راهی برای ایجاد تاثیر ماندگار در ذهن مشتری",
      firstParagraph:
        "کارت و پاکت‌های کاستومر یکی از ابزارهای مهم در بازاریابی و ارتباط با مشتریان به شمار می‌روند. این محصولات نه تنها به عنوان ابزاری برای ارسال اطلاعات و بسته‌بندی استفاده می‌شوند، بلکه به ایجاد هویت برند و افزایش شناخت در ذهن مشتریان کمک می‌کنند. طراحی زیبا و استفاده از مواد با کیفیت در تولید این کارت‌ها و پاکت‌ها، تأثیر بسزایی در جلب توجه و اعتماد مشتریان خواهد داشت",
      secondParagraph:
        "خدمات متنوعی که برای کارت و پاکت‌های کاستومر ارائه می‌دهیم، شامل طراحی اختصاصی، چاپ با بالاترین کیفیت و استفاده از متریال‌های مقاوم و جذاب است. انواع کارت و پاکت‌ها با گزینه‌های مختلف از جمله سایزهای مختلف، نوع جنس (فابریک، گلاسه، سلفون، کرافت و ...) و خدمات چاپ متنوع مثل برجسته، فرورفته و رنگ کوب، تمامی نیازهای شما را پوشش می‌دهند. این محصولات با توجه به نیازهای خاص هر کسب و کار، می‌توانند به بهترین شکل ممکن پیام برند شما را به مخاطبان منتقل کنند",
    },
  },
  {
    id: "clothTag",
    icon: TbCards,
    title: "کارت آویز و اتیکت پشت یقه",
    content: "جهت اطلاعات بیشتر راجع به خدمات کلیک کنید",
    backgroundImage: clothTag,
    services: [
      "نوع جنس: کاغذی (تحریر، گلاسه، نیمه‌گلاسه)، سلفون، کرافت، متالایز",
      "خدمات کوب: برجسته، فرورفته، انواع رنگ کوب",
      "تکستچر: فابیانو، چرمی، کتان، چکشی",
    ],
    description: {
      title: "کارت آویز و اتیکت پشت یقه؛ ترکیب سادگی و کارایی در بسته‌بندی",
      firstParagraph:
        "کارت آویز و اتیکت پشت یقه به عنوان یکی از ابزارهای مهم در صنعت مد و پوشاک، نه تنها برای شناسایی محصولات بلکه برای افزایش جذابیت و هویت برند نیز مورد استفاده قرار می‌گیرند. این محصولات با طراحی‌های خاص و متناسب با نیازهای مشتریان، به راحتی توجه خریداران را جلب می‌کنند و تاثیر زیادی بر تجربه خرید می‌گذارند. کارت آویز و اتیکت پشت یقه، با کیفیت‌های متنوع و متناسب با برند شما، به شما کمک می‌کند تا ظاهر محصولاتتان را به بهترین شکل ممکن نمایش دهید",
      secondParagraph:
        "این محصولات با جنس‌های مختلف از جمله کاغذی، سلفون، متالایز و کرافت در طرح‌ها و اندازه‌های مختلف تولید می‌شوند. علاوه بر این، خدمات کوب برجسته، فرورفته، رنگ کوب و استفاده از تکستچرهای متنوع مانند فابیانو، چرمی و کتان، به شما این امکان را می‌دهد که ظاهر و استایل خاصی به کارت آویز و اتیکت پشت یقه بدهید. این خدمات به ایجاد تمایز برای برند شما در بازار کمک می‌کنند و باعث می‌شوند محصولات شما به یک علامت تجاری خاص تبدیل شوند",
    },
  },
  {
    id: "ribbon",
    icon: LiaTapeSolid,
    title: "ربان چاپی",
    content: "جهت اطلاعات بیشتر راجع به خدمات مربوط به چاپ ربان کلیک کنید",
    backgroundImage: ribbon,
    services: [
      "نوع جنس: ساتن، ابریشم، نایلون، پلی استر، فوم، کتان و جیر",
      "خدمات کوب: برجسته، فرورفته، انواع رنگ کوب",
      "تکستچر: فابیانو، چرمی، کتان، چکشی، جیر",
    ],
    description: {
      title: "ربان چاپی؛ ابزاری ایده‌آل برای تبلیغات و بسته‌بندی",
      firstParagraph:
        "ربان چاپی یکی از ابزارهای پرکاربرد در صنعت بسته‌بندی و تبلیغات است که علاوه بر زیبایی، نقش مهمی در ارتقاء هویت برند و معرفی محصولات ایفا می‌کند. این ربان‌ها در طیف وسیعی از رنگ‌ها، طرح‌ها و عرض‌ها تولید می‌شوند و می‌توانند به عنوان یک عنصر تکمیلی برای بسته‌بندی‌های خاص یا به عنوان ابزار تبلیغاتی مورد استفاده قرار گیرند. از استفاده در بسته‌بندی‌های هدیه گرفته تا کاربرد در کیسه‌های خرید و دیگر محصولات تجاری، ربان چاپی گزینه‌ای عالی برای جذب توجه و ایجاد تاثیر مثبت بر مشتریان است",
      secondParagraph:
        "ربان چاپی با جنس‌های متنوعی همچون ساتن، ابریشمی، نایلونی و پلی استر تولید می‌شود که هر کدام ویژگی‌های خاص خود را دارند. با استفاده از خدمات چاپ متنوع، از جمله چاپ افست، چاپ سیلک و چاپ دیجیتال، می‌توانید لوگو، نام برند یا پیام تبلیغاتی خود را بر روی ربان‌ها چاپ کنید. همچنین، از خدمات کوب برجسته یا فرورفته و تکستچرهای خاص مثل فابیانو، چرمی یا کتان برای ایجاد جلوه‌ای خاص و متمایز استفاده کرد. این ویژگی‌ها کمک می‌کنند تا ربان چاپی شما نه تنها به عنوان یک وسیله کاربردی بلکه به عنوان ابزاری برای تبلیغات برند شما در دید مشتریان قرار گیرد",
    },
  },
  {
    id: "officeSet",
    icon: PiBuildingOffice,
    title: "ست اداری",
    content: "جهت اطلاعات بیشتر راجع به محصولات مربوط به ست اداری کلیک کنید",
    backgroundImage: officeSet,
    services: [
      "نوع جنس: ساتن، ابریشم، نایلون، پلی استر، فوم، کتان و جیر",
      "خدمات کوب: برجسته، فرورفته، انواع رنگ کوب",
      "تکستچر: فابیانو، چرمی، کتان، چکشی، جیر",
    ],
    description: {
      title: "ست اداری؛ ترکیبی از حرفه‌ای بودن و تأثیرگذاری در ارتباطات",
      firstParagraph:
        "ست اداری یک ابزار ضروری برای هر کسب‌وکار است که با ترکیب اجزای مختلفی چون کارت ویزیت، سربرگ‌های اداری، پاکت نامه و پاکت پستی، نمایانگر هویت برند و کیفیت خدمات شماست. این مجموعه، علاوه بر تأثیرگذاری بر مشتریان و مخاطبان، نقش مهمی در ایجاد نظم و انسجام در مستندات و مکاتبات تجاری دارد. طراحی مناسب و استفاده از مواد باکیفیت می‌تواند به طور چشم‌گیری در ایجاد تصویری حرفه‌ای و مثبت از برند شما مؤثر باشد",
      secondParagraph:
        "کارت ویزیت به عنوان اولین معرفی از کسب‌وکار شما، اطلاعات تماس و هویت برند را به شکلی ساده و جذاب منتقل می‌کند. سربرگ‌های اداری نیز به عنوان ابزار رسمی برای نوشتارهای اداری، نامه‌ها و قراردادها، اعتبار و حرفه‌ای بودن برند شما را به نمایش می‌گذارند. همچنین، پاکت‌های نامه و پستی، که هم به صورت ساده و هم به صورت سفارشی قابل طراحی هستند، به نحوی تأثیرگذار بر نحوه ارسال و دریافت مستندات و مراسلات به نظر می‌رسند و از اهمیت زیادی در ارائه یک تصویر سازمان‌یافته و مرتب برخوردار هستند",
    },
  },
];
